import "../../styles/kakao/AgreePopup.css";
import Button from "../common/Button";

const AgreePopup = ({ onCheck }) => {
  return (
    <div className="grayBox">
      <div className="AgreePopup">
        <h6>X</h6>
        <div className="text">
          <p>
            프레젠톡에서는 사용자가 제공하는 카카오톡 대화 내용을 분석하여,
            맞춤형 선물을 추천하는 서비스를 제공합니다. 서비스 제공을 위해
            필요한 개인정보를 수집하고 활용하는 것에 대한 동의를 받습니다. 아래
            내용을 충분히 읽고 동의 여부를 선택해 주세요.
          </p>
          <h3>1. 수집하는 개인정보 항목</h3>
          <p>
            - 카카오톡 대화 내용 파일 (사용자가 업로드한 파일에 포함된 텍스트 및
            대화 내용)
          </p>

          <h3>2. 개인정보 수집 및 이용 목적</h3>
          <p>
            - 제공된 카카오톡 대화 내용을 분석하여 사용자에게 맞춤형 선물을
            추천하는 서비스 제공
          </p>
          <p>- 선물 추천을 위한 데이터 분석 및 서비스 품질 향상</p>

          <h3>3. 개인정보 보유 및 이용 기간</h3>
          <p>
            - 수집된 개인정보는 서비스 제공 목적이 달성되면 즉시 파기됩니다.
          </p>
          <p>
            - 단, 법령에 의한 보관이 필요한 경우에는 해당 법령에 따라 일정 기간
            동안 보관됩니다.
          </p>

          <h3>4. 개인정보 제3자 제공</h3>
          <p>- 본 서비스는 사용자의 개인정보를 제3자에게 제공하지 않습니다.</p>

          <h3>5. 동의 거부 및 불이익</h3>
          <p>
            - 개인정보 제공에 동의하지 않으시면 맞춤형 선물 추천 서비스 이용이
            제한될 수 있습니다.
          </p>

          <h3>6. 개인정보 보호 및 보안</h3>
          <p>
            - 프레젠톡에서는 사용자 개인정보를 안전하게 보호하기 위해 암호화 및
            보안 기술을 적용하고 있으며, 외부 유출 방지를 위한 최선의 노력을
            다하고 있습니다.
          </p>
        </div>
        <Button text={"이용약관 동의"} type={"white"} onClick={onCheck} />
      </div>
    </div>
  );
};

export default AgreePopup;
